LaRutaDelPanda1

1. SERIE Y DATAFRAME

In [21]:
#IMPORTAR LIBRERIA
import pandas as pd

In [7]:
#CREAR SERIE
serie = pd.Series([1,2,3],index=['A','B','C'],name='Col1')
serie

A    1
B    2
C    3
Name: Col1, dtype: int64

In [9]:
#CREAR DATAFRAME (forma 1)
datos = [[1,4],[2,5],[3,6]]
index=['A','B','C']
columns=['Col1','Col2']

dataframe = pd.DataFrame(data=datos,index=index,columns=columns)
dataframe

   Col1  Col2
A     1     4
B     2     5
C     3     6

In [49]:
#CREAR DATAFRAME (forma 2)
dataframe2 = pd.DataFrame(data =[[1,7],[8,9]],index=['B','D'],columns=['Col1','Col3'])
dataframe2

   Col1  Col3
B     1     7
D     8     9

In [41]:
#CREAR COPIA AL DATAFRAME
dataframe3 = dataframe.copy()
dataframe3

   Col1  Col2
A     1     4
B     2     5
C     3     6

2. SELECCIONAR REGISTROS, COLUMNAS Y FILAS

In [15]:
#REGISTROS: SELECCIONAR LOS PRIMEROS REGISTROS
dataframe.head(2)

   Col1  Col2
A     1     4
B     2     5

In [16]:
#REGISTROS: SELECCIONAR LOS ULTIMOS REGISTROS
dataframe.tail(2)

   Col1  Col2
B     2     5
C     3     6

In [100]:
#COLUMNAS: SELECCIONAR 1
#dataframe['Col1']
dataframe.Col1

A    1
B    2
C    3
Name: Col1, dtype: int64

In [12]:
#COLUMNAS: SELECCIONAR MAS DE 1
dataframe[['Col1','Col2']]

   Col1  Col2
A     1     4
B     2     5
C     3     6

In [17]:
#FILAS: SELECCIONAR 1. LOCALIZAR POR NOMBRE DE INDEX
dataframe.loc['A']

Col1    1
Col2    4
Name: A, dtype: int64

In [18]:
#FILAS: SELECCIONAR MAS DE 1
dataframe.loc[['A','B']]

   Col1  Col2
A     1     4
B     2     5

In [27]:
#FILAS: SELECCIONAR 1. LOCALIZAR POR POSICION DE INDEX
dataframe.iloc[0]

Col1    1
Col2    4
Name: A, dtype: int64

In [28]:
#FILAS: SELECCIONAR MAS DE 1
dataframe.iloc[1:]

   Col1  Col2
B     2     5
C     3     6

3. REVISAR Y ENTENDER DATAFRAME

In [56]:
#INFORMACION BASE
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    3 non-null      int64
 1   Col2    3 non-null      int64
dtypes: int64(2)
memory usage: 180.0+ bytes

In [111]:
dataframe.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   level_0  3 non-null      int64
 1   index    3 non-null      object
 2   Col1     3 non-null      int64
 3   Col2     3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 378.0 bytes

In [81]:
#DIMENSIONES
dataframe.shape

(3, 2)

In [55]:
#DESCRIPCION ESTADISTICA
dataframe.describe()

       Col1  Col2
count   3.0   3.0
mean    2.0   5.0
std     1.0   1.0
min     1.0   4.0
25%     1.5   4.5
50%     2.0   5.0
75%     2.5   5.5
max     3.0   6.0

In [58]:
#VER NOMBRES DE FILAS
dataframe.index

Index(['A', 'B', 'C'], dtype='object')

In [57]:
#VER NOMBRES DE COLUMNAS
dataframe.columns

Index(['Col1', 'Col2'], dtype='object')

In [59]:
#VER TIPO DE DATO DE LAS COLUMNAS
dataframe.dtypes

Col1    int64
Col2    int64
dtype: object

In [82]:
#VER COLUMNAS CON DATO NUMERICO
dataframe._get_numeric_data()

   Col1  Col2
A     1     4
B     2     5
C     3     6

In [117]:
#
dataframe.sample(2)

   level_0 index  Col1  Col2
0        0     A     1     4
1        1     B     2     5

In [29]:
#FILTRAR DATOS POR VALOR EN COLUMNA
dataframe[dataframe['Col1']>1]

   Col1  Col2
B     2     5
C     3     6

In [30]:
#ORDENAR DATOS POR VALOR EN COLUMNA
dataframe.sort_values(['Col2'],ascending=False)

   Col1  Col2
C     3     6
B     2     5
A     1     4

In [31]:
#IDENTIFICAR REGISTROS UNICOS EN COLUMNA
dataframe['Col1'].unique()

array([1, 2, 3], dtype=int64)

In [32]:
#IDENTIFICAR REGISTROS DUPLICADOS EN COLUMNA
dataframe['Col1'].duplicated()

A    False
B    False
C    False
Name: Col1, dtype: bool

In [102]:
#IDENTIFICAR REGISTROS NULOS EN COLUMNA
#dataframe.isnull()
dataframe.isna()

    Col1   Col2
A  False  False
B  False  False
C  False  False

In [103]:
#IDENTIFICAR REGISTROS NO NULOS EN COLUMNA
dataframe.notna()

   Col1  Col2
A  True  True
B  True  True
C  True  True

4. TRANSFORMAR DATAFRAME

In [110]:
#RESETEAR INDEX
dataframe4 = dataframe.reset_index(inplace=True)
dataframe4

ValueError: cannot insert level_0, already exists

In [ ]:
#RENOMBRE COLUMNAS
#dataframe4 = dataframe.rename()
#dataframe4

In [88]:
#CAMBIAR TIPO DE DATO DE COLUMNA
dataframe4 = dataframe.astype(dtype='float32')
dataframe4.dtypes

Col1    float32
Col2    float32
dtype: object

In [112]:
#REEMPLAZAR COLUMNAS STR
#INSERTAR ATRIBUTOS STRING PARA PROBAR CODIGO
#dataframe4 = dataframe.str.replace()
#dataframe4

AttributeError: 'DataFrame' object has no attribute 'str'

In [39]:
#TRANSPONER FILAS Y COLUMNAS
#dataframe4 = dataframe.transpose()
dataframe4 = dataframe.T
dataframe4

      A  B  C
Col1  1  2  3
Col2  4  5  6

In [74]:
#BORRAR COLUMNA
dataframe5 = dataframe.drop('Col1',axis=1)
dataframe5

   Col2
A     4
B     5
C     6

In [78]:
#BORRAR FILA
dataframe6 = dataframe.drop('A',axis=0)
dataframe6

   Col1  Col2
B     2     5
C     3     6

In [79]:
#BORRAR NULOS DE COLUMNA
dataframe7 = dataframe.dropna()
dataframe7

   Col1  Col2
A     1     4
B     2     5
C     3     6

In [84]:
#RELLENAR NULOS DE COLUMNA
#dataframe7 = dataframe.fillna()
#dataframe7

In [104]:
#BORRAR DUPLICADOS DE COLUMNA
dataframe7 = dataframe.drop_duplicates()
dataframe7

   Col1  Col2
A     1     4
B     2     5
C     3     6

In [46]:
#ALTERAR REGISTROS
dataframe8 = dataframe + 5
dataframe8

   Col1  Col2
A     6     9
B     7    10
C     8    11

In [48]:
#CONCATENAR DATAFRAME
dataframe9 = pd.concat([dataframe,dataframe7])
dataframe9

   Col1  Col2
A     1     4
B     2     5
C     3     6
A     6     9
B     7    10
C     8    11

In [50]:
#INNER JOIN
dataframe10 = dataframe.merge(dataframe2)
dataframe10

   Col1  Col2  Col3
0     1     4     7

In [51]:
#LEFT JOIN
dataframe11 = dataframe.merge(dataframe2,how='left')
dataframe11

   Col1  Col2  Col3
0     1     4   7.0
1     2     5   NaN
2     3     6   NaN

In [52]:
#RIGHT JOIN
dataframe12 = dataframe.merge(dataframe2,how='right')
dataframe12

   Col1  Col2  Col3
0     1   4.0     7
1     8   NaN     9

In [53]:
#OUTER JOIN
dataframe13 = dataframe.merge(dataframe2,how='outer')
dataframe13

   Col1  Col2  Col3
0     1   4.0   7.0
1     2   5.0   NaN
2     3   6.0   NaN
3     8   NaN   9.0

In [54]:
#UNIR FILAS POR COINCIDENCIA DE INDEX
dataframe14 = dataframe.merge(dataframe2,left_index=True,right_index=True)
dataframe14

   Col1_x  Col2  Col1_y  Col3
B       2     5       1     7

5. OPERAR DATAFRAME

In [93]:
#SUMAR VALORES DE UNA COLUMNA
dataframe['Col1'].sum()

6

In [96]:
#PROMEDIO/MAX/MIN DE UNA COLUMNA
#dataframe['Col1'].mean()
dataframe['Col1'].max()
#dataframe['Col1'].min()

3

In [69]:
#CONTAR VALORES UNICOS DE UNA COLUMNA
dataframe[['Col1']].value_counts()

Col1
1       1
2       1
3       1
Name: count, dtype: int64

Object `Sample` not found.